/* 
문제 정의
N개의 마을로 이루어진 나라가 있습니다.
각 마을은 양방향으로 통행할 수 있는 도로로 연결되어 있습니다.
N개의 마을 중에서 K 시간 이하로 배달이 가능한 마을에서만 주문을 받으려고 합니다.

마을의 개수 N, 각 마을을 연결하는 도로의 정보 road, 음식 배달이 가능한 시간 K가 매개변수로 주어질 때, 
1번 마을에서 음식 주문을 받을 수 있는 마을의 개수를 return

풀이 과정
1번 마을에서 i번 마을까지 가는 최소 시간을 각각 구해서 저장해보자.

다익스트라 알고리즘 쓰자
*/

/* 
문제 풀이
*/

import java.util.*;

class Solution {
    public int solution(int N, int[][] road, int K) {

        int answer = 0;

      

        return answer;
    }
}

/* 

*/
